///ЛАБ 5
#include <stdio.h>
int main() {
   //задание 1
   //инициализируем и заполняем массив
   int a[9] = {88, 112, 6467, 325, 878, 3, 77, 8, 99};
   //выводим все элемменты массива
   for (int i = 0; i < 9; ++i)
   {
       printf("%i ",a[i]);
   }
   printf("\n\n");

   //задание 2
   //инициализируем и заполняем матрицу 1
   int matrix_1[2][2] ={1,2,3,1};
   //инициализируем и заполняем матрицу 2
   int matrix_2[2][2] ={1,1,0,2};
   //инициализируем и заполняем итоговую матрицу
   int matrix_3[2][2] ={-1,-1,-11,-1};
   //перемножаем матрицы циклом
   for(int i = 0; i < 2; i++)
       for(int j = 0; j < 2; j++)
       {
           matrix_3[i][j] = 0;
           for(int k = 0; k < 2; k++)
               matrix_3[i][j] += matrix_1[i][k] * matrix_2[k][j];
       }

   //вывод итоговой матрицы
   printf("%i ",matrix_3[0][0]);
   printf("%i\n",matrix_3[0][1]);
   printf("%i ",matrix_3[1][0]);
   printf("%i",matrix_3[1][1]);
   return 0;
}
